---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotTextFromLeader
source: html/f5aec6da-5317-96e0-b823-75b5c884f934.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotTextFromLeader Property

"Text Offset from Leader"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotTextFromLeader { get; }
```